# Taps
tap "homebrew/bundle"
tap "homebrew/services"
tap "shivammathur/extensions"
tap "shivammathur/php"
tap "symfony-cli/tap"

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install Binaries
Brew '1Password'
brew 'composer'
brew 'curl'
brew 'fontforge'
brew 'git'
brew "jsonpp"
brew 'mackup'
brew 'mas'
brew 'mysql'
brew "mysql-client@5.7"
brew 'npm'
brew 'ruby'
brew 'tag'
brew "volta"
brew "wget"
brew "zsh"
brew "zsh-completions"
brew "shivammathur/extensions/imagick@7.3"
brew "shivammathur/extensions/imagick@7.4"
brew "shivammathur/extensions/memcache@7.4"
brew "shivammathur/extensions/msgpack@7.4"
brew "shivammathur/extensions/memcached@7.4"
brew "shivammathur/php/php@5.6"
brew "shivammathur/php/php@7.0"
brew "shivammathur/php/php@7.1"
brew "shivammathur/php/php@7.2"
brew "shivammathur/php/php@7.3"
brew "shivammathur/php/php@7.4"
brew "shivammathur/php/php@8.0"
brew "shivammathur/php/php@8.1"
brew "shivammathur/php/php@8.2"
brew "shivammathur/php/php@8.3"
brew "symfony-cli/tap/symfony-cli"



# Install Apps
cask 'cleanmymac'
cask 'dropbox'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'google-drive'
cask 'microsoft-excel'
cask 'microsoft-onenote'
cask 'microsoft-outlook'
cask 'microsoft-powerpoint'
cask 'microsoft-teams'
cask 'microsoft-word'
cask 'onedrive'
cask 'orbstack'
cask 'phpstorm'
cask "postman"
cask 'pycharm'
cask "raycast"
cask 'sequel-ace'
cask 'slack'
cask 'spotify'
cask 'textmate'
cask 'the-unarchiver'
cask 'transmit'
cask 'whatsapp'


# Install Mac Store Apps
mas 'Telephone', id: 406825478
mas '1Blocker - Ad Blocker', id: 1365531024
