# Taps
tap 'caskroom/cask'
tap 'homebrew/dupes'
tap 'homebrew/php'


# Install ZSH
brew 'zsh'
brew 'zsh-completions'


# Install Binaries
brew 'composer'
brew 'curl'
brew 'git'
brew 'mackup'
brew 'mas'
brew 'pow'
brew 'ruby'


# Install Apps
cask 'cleanmymac'
cask 'clamxav'
cask 'dropbox'
cask 'google-chrome'
cask 'google-drive'
cask 'ocrkit'
cask 'phpstorm'
cask 'sequel-pro'
cask 'skitch'
cask 'skype'
cask 'slack'
cask 'spotify'
cask 'sqlpro-for-sqlite'
cask 'textmate'
cask 'the-unarchiver'
cask 'transmit'


# Install Mac Store Apps
mas '1Password', id: 443987910
