# Taps
tap 'caskroom/cask'
tap 'homebrew/dupes'
tap 'homebrew/php'


# Install ZSH
brew 'zsh'
brew 'zsh-completions'


# Install Binaries
brew 'composer'
brew 'curl'
brew 'git'
brew 'mackup'
brew 'mas'
brew 'pow'
brew 'rbenv'
brew 'ruby'
brew 'tag'


# Install Apps
cask 'alfred'
cask 'cleanmymac'
cask 'dropbox'
cask 'google-chrome'
cask 'google-backup-and-sync'
cask 'phpstorm'
cask 'prey'
cask 'sequel-pro'
cask 'skitch'
cask 'skype'
cask 'slack'
cask 'spotify'
cask 'textmate'
cask 'the-unarchiver'
cask 'transmit'


# Install Mac Store Apps
mas '1Password', id: 443987910
mas 'Active Collab Timer', id: 1005615923
mas 'BetterSnapTool', id: 417375580
mas 'OCRKit', id: 410309628